#+PROPERTY: header-args :exports both
#+OPTIONS: toc:2
#+TITLE: Computer Programming Final Exam Answers

***** Example
#+begin_src C++ :includes <iostream> :namespaces std :results output :noweb yes :exports both
  <<tic-tac-toe>>
  ttt_board[0][2] = "x";
  for (int i = 0; i < 3; ++i) {
    for (int j = 0; j < 3; ++j) {
      cout << ttt_board[i][j] << ' ';
    }
    cout << '\n';
   }
#+end_src

#+RESULTS:
: x x x 
: o o x 
: x o   

**** How can you print all positive values in an array, separated by commas?  *

#+begin_src C++ :includes <iostream> :namespaces std :results output :exports both
  int a[6] = {6, 2, -8, 0, -3, 10};
  int a_size = 6;

  for (int i = 0; i < a_size; ++i) {
    if (a[i] > 0) {
      if (i == a_size - 1) {
        cout << a[i];
      } else {
        cout << a[i] << ", ";
      }
    }
  }
#+end_src

#+RESULTS:
: 6, 2, 10

***** Example

#+begin_src C++ :includes <iostream> :namespaces std :results output :noweb yes :exports both
  <<find-position>>

  int main() {
    int a[6] = {6, 2, -8, 0, -3, 10};
    cout << find_position(a, 6, -8) << '\n';
    cout << find_position(a, 6, 10) << '\n';
    cout << find_position(a, 6, 2) << '\n';
    return 0;
  }
#+end_src

#+RESULTS:
: 2
: 5
: 1

**** Consider this set of statements. What is printed? (2pts)

#+begin_src C++ :includes <iostream> :namespaces std :results output :exports both
  int a = 1;
  int b = 2;
  int* p = &a;

  cout << *p << endl;
  p = &b;
  cout << *p << endl;
#+end_src

#+RESULTS:
: 1
: 2

**** Consider this set of statements. What is printed? 

#+begin_src C++ :includes <iostream> :namespaces std :results output :exports both
  int a = 1;
  int b = 2;
  int* p = &a;
  int* q = &b;

  ,*p = *q;
  cout << a << " " << b << endl;
#+end_src

#+RESULTS:
: 2 2

**** Consider this set of statements. What is printed? 

#+begin_src C++ :includes <iostream> :namespaces std :results output :exports both
  int a = 15;
  int* p = &a;
  int* q = &a;

  cout << *p + *q << endl;
#+end_src

#+RESULTS:
: 30

**** Consider this set of statements. What is printed? 

#+begin_src C++ :includes <iostream> :namespaces std :results output :exports both
  int a = 15;
  int* p = &a;
  int* q = &a;

  ,*p = *p + 10;
  cout << *q << endl;
#+end_src

#+RESULTS:
: 25

**** Consider this set of statements. What is printed? 

#+begin_src C++ :includes <iostream> :namespaces std :results output :exports both
  int a = 15;
  int* p = &a;

  cout << *p << " " << p << endl;
#+end_src

#+RESULTS:
: 15 0x7ffce1741ee4

**** What is the contents of the array a after these statements? 

#+begin_src C++ :includes <iostream> :namespaces std :results output :exports both
  int a[ ] = { 2, 3, 5 };

  int* p = a + 1;
  ,*(p + 1) = 0;

  // Print array
  for (int i = 0; i < 3; ++i) {
    cout << a[i] << ((i < 3 - 1) ? ", " : "");
  }
#+end_src

#+RESULTS:
: 2, 3, 0

**** What is the contents of the array a after these statements? 

#+begin_src C++ :includes <iostream> :namespaces std :results output :exports both
  int a[] = { 2, 3, 5 };
  int* p = a;
  int* q = a + 2;

  p++;
  q--;
  ,*p = *q;

  // Print array
  for (int i = 0; i < 3; ++i) {
    cout << a[i] << ((i < 3 - 1) ? ", " : "");
  }
#+end_src

#+RESULTS:
: 2, 3, 5

**** What do the following statements print? 

#+begin_src C++ :includes <iostream> :namespaces std :results output :exports both
  int a[ ] = { 2, 3, 5 };

  cout << *a + 2 << " ";
  cout << *(a + 2) << endl;
#+end_src

#+RESULTS:
: 4 5


**** What is strlen("Hello, World!\n")? 

#+begin_src C++ :includes iostream cstring :namespaces std :results output :exports both
  cout << strlen("Hello, World!\n");
#+end_src

#+RESULTS:
: 14

